In [1]:
import duckdb as ddb
import pandas as pd

In [2]:
con=ddb.connect("../air_quality.db")

con

In [3]:
df=con.query("select * from raw.air_quality_data where parameter in ('so2', 'pm10','pm25')").to_df()
df.head()

,location_id,sensors_id,location,datetime,lat,lon,parameter,units,value,month,year,ingestion_datetime
0,13,13864,"Delhi Technological University, Delhi - CPCB-13",2017-12-31 18:45:00,28.744,77.12,pm25,µg/m³,445.0,01,2018,2025-01-22 13:11:30.158
1,13,13864,"Delhi Technological University, Delhi - CPCB-13",2017-12-31 19:00:00,28.744,77.12,pm25,µg/m³,317.0,01,2018,2025-01-22 13:11:30.158
2,13,13864,"Delhi Technological University, Delhi - CPCB-13",2017-12-31 19:15:00,28.744,77.12,pm25,µg/m³,310.0,01,2018,2025-01-22 13:11:30.158
3,13,13864,"Delhi Technological University, Delhi - CPCB-13",2017-12-31 19:30:00,28.744,77.12,pm25,µg/m³,310.0,01,2018,2025-01-22 13:11:30.158
4,13,13864,"Delhi Technological University, Delhi - CPCB-13",2017-12-31 20:00:00,28.744,77.12,pm25,µg/m³,289.0,01,2018,2025-01-22 13:11:30.158

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1680 entries, 0 to 1679
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   location_id         1680 non-null   int64
 1   sensors_id          1680 non-null   int64
 2   location            1680 non-null   object
 3   datetime            1680 non-null   datetime64[us]
 4   lat                 1680 non-null   float64
 5   lon                 1680 non-null   float64
 6   parameter           1680 non-null   object
 7   units               1680 non-null   object
 8   value               1680 non-null   float64
 9   month               1680 non-null   object
 10  year                1680 non-null   int64
 11  ingestion_datetime  1680 non-null   datetime64[us]
dtypes: datetime64[us](2), float64(3), int64(3), object(4)
memory usage: 157.6+ KB

In [5]:
df.describe()

,location_id,sensors_id,datetime,lat,lon,value,year,ingestion_datetime
count,1680.0,1680.0,1680,1.680000e+03,1680.00,1680.000000,1680.0,1680
mean,13.0,13864.0,2018-01-16 03:02:47.678571,2.874400e+01,77.12,280.723214,2018.0,2025-01-22 13:11:30.158000
min,13.0,13864.0,2017-12-31 18:45:00,2.874400e+01,77.12,55.000000,2018.0,2025-01-22 13:11:30.158000
25%,13.0,13864.0,2018-01-08 17:56:15,2.874400e+01,77.12,150.000000,2018.0,2025-01-22 13:11:30.158000
50%,13.0,13864.0,2018-01-16 08:00:00,2.874400e+01,77.12,256.000000,2018.0,2025-01-22 13:11:30.158000
75%,13.0,13864.0,2018-01-23 04:52:30,2.874400e+01,77.12,377.000000,2018.0,2025-01-22 13:11:30.158000
max,13.0,13864.0,2018-01-31 17:45:00,2.874400e+01,77.12,909.000000,2018.0,2025-01-22 13:11:30.158000
std,0.0,0.0,NaN,1.066131e-14,0.00,157.493920,0.0,NaN

In [5]:
df.describe(include='O')

                                               location parameter  units month
count                                              1680      1680   1680  1680
unique                                                1         1      1     1
top     Delhi Technological University, Delhi - CPCB-13      pm25  µg/m³    01
freq                                               1680      1680   1680  1680

In [6]:
df[df.duplicated(subset=['location_id','parameter', 'units','value','datetime'])]

Empty DataFrame
Columns: [location_id, sensors_id, location, datetime, lat, lon, parameter, units, value, month, year, ingestion_datetime]
Index: []

In [7]:
df.groupby(by='parameter', as_index=False).count()

,parameter,location_id,sensors_id,location,datetime,lat,lon,units,value,month,year,ingestion_datetime
0,pm25,1680,1680,1680,1680,1680,1680,1680,1680,1680,1680,1680

In [8]:
df[df["value"]<0]

Empty DataFrame
Columns: [location_id, sensors_id, location, datetime, lat, lon, parameter, units, value, month, year, ingestion_datetime]
Index: []

In [9]:
con.close()